In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

In [2]:
data = pd.ExcelFile('KPMG_M1_not_cleaned.xlsx')

tran = pd.read_excel(data, 'Transactions')
new_cus = pd.read_excel(data, 'NewCustomerList')
dem = pd.read_excel(data, 'CustomerDemographic')
address = pd.read_excel(data, 'CustomerAddress')

# Transactions List

In [3]:
tran.head(5)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,140,11,462,2017-01-01,0.0,Approved,Giant Bicycles,Standard,high,medium,1274.93,764.96,2016-07-09
1,517,77,311,2017-01-01,1.0,Approved,WeareA2B,Standard,medium,medium,1769.64,108.76,2011-05-09
2,561,65,2298,2017-01-01,0.0,Approved,WeareA2B,Standard,medium,medium,1807.45,778.69,2010-08-20
3,1293,67,1931,2017-01-01,1.0,Approved,Norco Bicycles,Road,medium,medium,544.05,376.84,2005-10-22
4,1403,0,2891,2017-01-01,1.0,Approved,OHM Cycles,Standard,medium,medium,183.86,137.90,1993-07-20

In [4]:
tran.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(3), int64(3), object(5)
memory usage: 2.0+ MB

In [5]:
tran[['transaction_date', 'online_order', 'order_status', 'brand', 'product_line', 'product_class', 'product_size', 'list_price', 'standard_cost', 'product_first_sold_date']]

,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,2017-01-01,0.0,Approved,Giant Bicycles,Standard,high,medium,1274.93,764.96,2016-07-09
1,2017-01-01,1.0,Approved,WeareA2B,Standard,medium,medium,1769.64,108.76,2011-05-09
2,2017-01-01,0.0,Approved,WeareA2B,Standard,medium,medium,1807.45,778.69,2010-08-20
3,2017-01-01,1.0,Approved,Norco Bicycles,Road,medium,medium,544.05,376.84,2005-10-22
4,2017-01-01,1.0,Approved,OHM Cycles,Standard,medium,medium,183.86,137.90,1993-07-20
...,...,...,...,...,...,...,...,...,...,...
19995,2017-12-30,0.0,Approved,Trek Bicycles,Standard,medium,small,1775.81,1580.47,1996-04-05
19996,2017-12-30,0.0,Approved,Trek Bicycles,Standard,medium,medium,499.53,388.72,1999-06-23
19997,2017-12-30,0.0,Approved,Giant Bicycles,Standard,high,medium,1129.13,677.48,2011-04-16
19998,2017-12-30,0.0,Approved,Norco Bicycles,Standard,low,medium,958.74,748.90,2005-12-07
19999,2017-12-30,0.0,Approved,Solex,Standard,medium,medium,1483.20,99.59,2005-10-22

In [6]:
tran.duplicated().sum()

0

In [7]:
tran.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [8]:
tran.duplicated().sum()

0

In [9]:
tran.nunique()

transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

In [10]:
tran.dropna(inplace=True)

In [11]:
tran.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19445 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19445 non-null  int64
 1   product_id               19445 non-null  int64
 2   customer_id              19445 non-null  int64
 3   transaction_date         19445 non-null  datetime64[ns]
 4   online_order             19445 non-null  float64
 5   order_status             19445 non-null  object
 6   brand                    19445 non-null  object
 7   product_line             19445 non-null  object
 8   product_class            19445 non-null  object
 9   product_size             19445 non-null  object
 10  list_price               19445 non-null  float64
 11  standard_cost            19445 non-null  float64
 12  product_first_sold_date  19445 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(3), int64(3), object(5)
memory usage: 2.1+ MB

In [12]:
tran['online_order'].value_counts()

1.0    9739
0.0    9706
Name: online_order, dtype: int64

In [13]:
tran['order_status'].value_counts()

Approved     19273
Cancelled      172
Name: order_status, dtype: int64

In [14]:
tran['brand'].value_counts()

Solex             4169
WeareA2B          3245
Giant Bicycles    3244
OHM Cycles        2993
Trek Bicycles     2931
Norco Bicycles    2863
Name: brand, dtype: int64

In [15]:
tran['product_line'].value_counts()

Standard    13920
Road         3894
Touring      1213
Mountain      418
Name: product_line, dtype: int64

In [16]:
tran['product_class'].value_counts()

medium    13587
high       2952
low        2906
Name: product_class, dtype: int64

In [17]:
tran['product_size'].value_counts()

medium    12767
large      3900
small      2778
Name: product_size, dtype: int64

In [18]:
tran['list_price'].max()

2091.47

In [19]:
tran['list_price'].min()

12.01

In [20]:
tran['standard_cost'].max()

1759.85

In [21]:
tran['standard_cost'].min()

7.21

In [22]:
tran['product_first_sold_date'].min()

Timestamp('1991-01-21 00:00:00')

In [23]:
tran['product_first_sold_date'].max()

Timestamp('2016-12-06 00:00:00')

# New Customer List

In [24]:
new_cus.head(10)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Rank,Value
0,Anthony,Morison,Male,7,1938-06-08,General Manager,Health,Mass Customer,N,No,12,276 Derek Circle,2759,NSW,Australia,9,797,0.600000
1,Zachariah,Meininking,Male,40,1938-06-09,Cost Accountant,Financial Services,Affluent Customer,N,Yes,20,24815 Lindbergh Avenue,2749,NSW,Australia,7,883,0.531250
2,Andrea,Pendle,Female,86,1938-08-05,NaN,NaN,High Net Worth,N,Yes,13,31281 Meadow Valley Way,4500,QLD,Australia,6,760,0.637500
3,Letizia,Poore,Female,27,1938-08-30,Web Developer II,Manufacturing,Affluent Customer,N,No,15,95796 Mcbride Drive,3677,VIC,Australia,3,583,0.787500
4,Alleen,Eaken,Female,56,1938-08-31,NaN,NaN,Mass Customer,N,No,10,343 Lakewood Center,2089,NSW,Australia,12,259,1.062500
5,Willard,Booton,Male,69,1938-09-02,NaN,Health,High Net Worth,N,Yes,7,05 Ronald Regan Alley,2121,NSW,Australia,9,688,0.697000
6,Wyn,Meach,Male,37,1938-09-10,NaN,Manufacturing,Mass Customer,N,No,9,79 Armistice Junction,2765,NSW,Australia,9,415,0.921875
7,Franklin,Wohler,Male,55,1938-10-16,Clinical Specialist,Health,Mass Customer,N,Yes,7,6966 Delladonna Street,2250,NSW,Australia,8,191,1.150000
8,Odilia,Quick,Female,65,1938-11-09,General Manager,Manufacturing,Affluent Customer,N,Yes,11,1550 Russell Way,2222,NSW,Australia,11,19,1.531250
9,Kippar,Brimilcome,Male,21,1938-11-29,Graphic Designer,Health,Mass Customer,N,No,19,082 Welch Lane,2089,NSW,Australia,11,405,0.930000

In [25]:
new_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Rank                                 1000 non-null   int64
 17  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(11)
memory usage: 140.8+ KB

In [26]:
new_cus.duplicated().sum()

0

In [27]:
new_cus.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [28]:
new_cus.dropna(subset=['DOB', 'job_title', 'job_industry_category'], inplace=True)
new_cus.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 735 entries, 0 to 981
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           735 non-null    object
 1   last_name                            715 non-null    object
 2   gender                               735 non-null    object
 3   past_3_years_bike_related_purchases  735 non-null    int64
 4   DOB                                  735 non-null    datetime64[ns]
 5   job_title                            735 non-null    object
 6   job_industry_category                735 non-null    object
 7   wealth_segment                       735 non-null    object
 8   deceased_indicator                   735 non-null    object
 9   owns_car                             735 non-null    object
 10  tenure                               735 non-null    int64
 11  address                              735 non-null    object
 12  postcode                             735 non-null    int64
 13  state                                735 non-null    object
 14  country                              735 non-null    object
 15  property_valuation                   735 non-null    int64
 16  Rank                                 735 non-null    int64
 17  Value                                735 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(5), object(11)
memory usage: 109.1+ KB

In [29]:
new_cus.nunique()

first_name                             701
last_name                              709
gender                                   2
past_3_years_bike_related_purchases     99
DOB                                    720
job_title                              178
job_industry_category                    9
wealth_segment                           3
deceased_indicator                       1
owns_car                                 2
tenure                                  22
address                                735
postcode                               442
state                                    3
country                                  1
property_valuation                      12
Rank                                   292
Value                                  287
dtype: int64

In [30]:
new_cus['gender'].value_counts()

Female    380
Male      355
Name: gender, dtype: int64

In [31]:
new_cus['job_industry_category'].value_counts()

Financial Services    187
Manufacturing         175
Health                138
Retail                 73
Property               51
Entertainment          34
IT                     30
Argiculture            24
Telecommunications     23
Name: job_industry_category, dtype: int64

In [32]:
new_cus['deceased_indicator'].unique()

array(['N'], dtype=object)

In [33]:
new_cus['wealth_segment'].value_counts()

Mass Customer        369
High Net Worth       184
Affluent Customer    182
Name: wealth_segment, dtype: int64

In [34]:
new_cus['owns_car'].value_counts()

No     376
Yes    359
Name: owns_car, dtype: int64

In [35]:
new_cus['state'].value_counts()

NSW    364
VIC    200
QLD    171
Name: state, dtype: int64

In [36]:
new_cus['property_valuation'].value_counts()

9     126
8     106
7      98
10     95
6      54
11     46
5      41
4      38
2      36
12     35
3      34
1      26
Name: property_valuation, dtype: int64

In [37]:
new_cus['DOB'].min()

Timestamp('1938-06-08 00:00:00')

In [38]:
new_cus['DOB'].max()

Timestamp('2002-01-17 00:00:00')

In [39]:
new_cus['tenure'].min()

1

In [40]:
new_cus['tenure'].max()

22

# Customer Demographics

In [41]:
dem

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,34,Jephthah,Bachmann,U,59,1843-12-21,Legal Assistant,IT,Affluent Customer,N,NaN,No,20.0
1,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6.0
2,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5.0
3,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,á,No,16.0
4,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3779,Ulick,Daspar,U,68,NaT,NaN,IT,Affluent Customer,N,NaN,No,NaN
3996,3883,Nissa,Conrad,U,35,NaT,Legal Assistant,IT,Mass Customer,N,NaN,No,NaN
3997,3931,Kylie,Epine,U,19,NaT,NaN,IT,High Net Worth,N,NaN,Yes,NaN
3998,3935,Teodor,Alfonsini,U,72,NaT,NaN,IT,High Net Worth,N,NaN,Yes,NaN
3999,3998,Sarene,Woolley,U,60,NaT,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN

In [42]:
dem.drop(['customer_id', 'first_name', 'last_name', 'default'], axis = 1, inplace = True)

In [43]:
dem.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   gender                               4000 non-null   object
 1   past_3_years_bike_related_purchases  4000 non-null   int64
 2   DOB                                  3913 non-null   datetime64[ns]
 3   job_title                            3494 non-null   object
 4   job_industry_category                3344 non-null   object
 5   wealth_segment                       4000 non-null   object
 6   deceased_indicator                   4000 non-null   object
 7   owns_car                             4000 non-null   object
 8   tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(6)
memory usage: 281.4+ KB

In [44]:
dem.duplicated().sum()

0

In [45]:
dem.isnull().sum()

gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                  87
dtype: int64

In [46]:
dem.dropna(subset=['DOB'], inplace=True)
dem.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3913 entries, 0 to 3912
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   gender                               3913 non-null   object
 1   past_3_years_bike_related_purchases  3913 non-null   int64
 2   DOB                                  3913 non-null   datetime64[ns]
 3   job_title                            3416 non-null   object
 4   job_industry_category                3257 non-null   object
 5   wealth_segment                       3913 non-null   object
 6   deceased_indicator                   3913 non-null   object
 7   owns_car                             3913 non-null   object
 8   tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(6)
memory usage: 305.7+ KB

In [47]:
dem['job_industry_category'].unique()

array(['IT', 'Retail', 'Property', 'Manufacturing', 'Health',
       'Entertainment', 'Financial Services', nan, 'Argiculture',
       'Telecommunications'], dtype=object)

### Checking for correlation between job industry category and number of sales

In [48]:
dem1 = dem.copy()

In [49]:
dem1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3913 entries, 0 to 3912
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   gender                               3913 non-null   object
 1   past_3_years_bike_related_purchases  3913 non-null   int64
 2   DOB                                  3913 non-null   datetime64[ns]
 3   job_title                            3416 non-null   object
 4   job_industry_category                3257 non-null   object
 5   wealth_segment                       3913 non-null   object
 6   deceased_indicator                   3913 non-null   object
 7   owns_car                             3913 non-null   object
 8   tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(6)
memory usage: 305.7+ KB

In [50]:
dem1.dropna(subset=['job_title', 'job_industry_category'], inplace=True)
dem1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2865 entries, 0 to 3912
Data columns (total 9 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   gender                               2865 non-null   object
 1   past_3_years_bike_related_purchases  2865 non-null   int64
 2   DOB                                  2865 non-null   datetime64[ns]
 3   job_title                            2865 non-null   object
 4   job_industry_category                2865 non-null   object
 5   wealth_segment                       2865 non-null   object
 6   deceased_indicator                   2865 non-null   object
 7   owns_car                             2865 non-null   object
 8   tenure                               2865 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(6)
memory usage: 223.8+ KB

In [51]:
dem1[dem1['job_industry_category'] == 'IT']['past_3_years_bike_related_purchases'].sum()

6496

In [52]:
dem1[dem1['job_industry_category'] == 'IT']['past_3_years_bike_related_purchases'].sum()

6496

In [53]:
dict = {}

for x in dem1['job_industry_category'].unique():
    dict[x] = dem1[dem1['job_industry_category'] == x]['past_3_years_bike_related_purchases'].sum()

dict

{'IT': 6496,
 'Retail': 15054,
 'Manufacturing': 34702,
 'Health': 27181,
 'Entertainment': 5784,
 'Financial Services': 33171,
 'Property': 11540,
 'Argiculture': 5285,
 'Telecommunications': 2597}

In [54]:
dem1['job_industry_category'].value_counts(sort=False)

IT                    127
Retail                305
Manufacturing         695
Health                543
Entertainment         122
Financial Services    682
Property              231
Argiculture            99
Telecommunications     61
Name: job_industry_category, dtype: int64

### We see that there is not much correlation between job industry category and number of sales, hence we can drop it

In [55]:
dem.drop(['job_title', 'job_industry_category'], axis=1, inplace=True)
dem.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3913 entries, 0 to 3912
Data columns (total 7 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   gender                               3913 non-null   object
 1   past_3_years_bike_related_purchases  3913 non-null   int64
 2   DOB                                  3913 non-null   datetime64[ns]
 3   wealth_segment                       3913 non-null   object
 4   deceased_indicator                   3913 non-null   object
 5   owns_car                             3913 non-null   object
 6   tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 244.6+ KB

In [56]:
dem['gender'].value_counts()

Female    2037
Male      1872
U            1
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [57]:
dem['wealth_segment'].value_counts()

Mass Customer        1954
High Net Worth        996
Affluent Customer     963
Name: wealth_segment, dtype: int64

In [58]:
dem['deceased_indicator'].value_counts()

N    3911
Y       2
Name: deceased_indicator, dtype: int64

In [59]:
dem['owns_car'].value_counts()

Yes    1974
No     1939
Name: owns_car, dtype: int64

In [60]:
print(dem['tenure'].min())
print(dem['tenure'].max())

1.0
22.0

# Customer Addresses

In [61]:
address

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9
...,...,...,...,...,...,...
3994,3999,1482 Hauk Trail,3064,VIC,Australia,3
3995,4000,57042 Village Green Point,4511,QLD,Australia,6
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10
3997,4002,8194 Lien Street,4032,QLD,Australia,7
3998,4003,320 Acker Drive,2251,NSW,Australia,7

In [62]:
address.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB